class Review {
  // ==========================================================
  // ID DE LA RESEÑA
  // ==========================================================

  final int id;

  // ==========================================================
  // ID DEL PRODUCTO
  // ==========================================================

  final int productoId;

  // ==========================================================
  // USUARIO QUE DEJÓ LA RESEÑA
  // ==========================================================

  final String usuarioId;
  final String nombreUsuario;

  // ==========================================================
  // CALIFICACIÓN
  // ==========================================================

  final double calificacion;

  // ==========================================================
  // COMENTARIO
  // ==========================================================

  final String comentario;

  // ==========================================================
  // FECHA
  // ==========================================================

  final DateTime fecha;

  // ==========================================================
  // CONSTRUCTOR
  // ==========================================================

  Review({
    required this.id,
    required this.productoId,
    required this.usuarioId,
    required this.nombreUsuario,
    required this.calificacion,
    required this.comentario,
    required this.fecha,
  });
}